#### Density Property

---

|  |
| --- |
| ThermalAsset Class   See Also |

The density of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Density { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Density As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Density { 	double get (); 	void set (double value); } ``` |

# Remarks

Values are in kilograms per cubed feet (kg/ftÂ³) and must be non-negative.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for density must be non-negative. |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace